{
  "vocab": {
    "[PAD]": 0,
    "[UNK]": 1,
    "[CLS]": 2,
    "[SEP]": 3,
    "alright": 4,
    "guys": 5,
    "welcome": 6,
    "back": 7,
    "to": 8,
    "another": 9,
    "exciting": 10,
    "episode": 11,
    "of": 12,
    "drive": 13,
    "with": 14,
    "me": 15,
    "in": 16,
    "this": 17,
    "video": 18,
    "we": 19,
    "will": 20,
    "talk": 21,
    "about": 22,
    "monolith": 23,
    "versus": 24,
    "microservices": 25,
    "architecture": 26,
    "understand": 27,
    "what": 28,
    "a": 29,
    "is": 30,
    "and": 31,
    "discuss": 32,
    "their": 33,
    "tradeoffs": 34,
    "you": 35,
    "should": 36,
    "use": 37,
    "lets": 38,
    "start": 39,
    "monolithic": 40,
    "mono": 41,
    "means": 42,
    "one": 43,
    "all": 44,
    "backend": 45,
    "code": 46,
    "stored": 47,
    "single": 48,
    "repository": 49,
    "for": 50,
    "example": 51,
    "an": 52,
    "ecommerce": 53,
    "app": 54,
    "authentication": 55,
    "orders": 56,
    "payments": 57,
    "product": 58,
    "are": 59,
    "place": 60,
    "push": 61,
    "your": 62,
    "deploy": 63,
    "the": 64,
    "entire": 65,
    "on": 66,
    "server": 67,
    "up": 68,
    "running": 69,
    "as": 70,
    "application": 71,
    "scales": 72,
    "becomes": 73,
    "bottleneck": 74,
    "cannot": 75,
    "handle": 76,
    "requests": 77,
    "solve": 78,
    "do": 79,
    "horizontal": 80,
    "scaling": 81,
    "by": 82,
    "adding": 83,
    "more": 84,
    "servers": 85,
    "add": 86,
    "load": 87,
    "works": 88,
    "but": 89,
    "there": 90,
    "problems": 91,
    "if": 92,
    "bug": 93,
    "whole": 94,
    "can": 95,
    "crash": 96,
    "services": 97,
    "like": 98,
    "go": 99,
    "down": 100,
    "not": 101,
    "good": 102,
    "ideally": 103,
    "fails": 104,
    "only": 105,
    "stop": 106,
    "working": 107,
    "has": 108,
    "no": 109,
    "segregation": 110,
    "also": 111,
    "over": 112,
    "time": 113,
    "complex": 114,
    "hard": 115,
    "manage": 116,
    "pro": 117,
    "that": 118,
    "easy": 119,
    "codebase": 120,
    "con": 121,
    "it": 122,
    "point": 123,
    "failure": 124,
    "solution": 125,
    "segregate": 126,
    "into": 127,
    "separate": 128,
    "called": 129,
    "each": 130,
    "feature": 131,
    "its": 132,
    "own": 133,
    "independent": 134,
    "microservice": 135,
    "service": 136,
    "managing": 137,
    "many": 138,
    "repositories": 139,
    "harder": 140,
    "need": 141,
    "team": 142,
    "developers": 143,
    "cost": 144,
    "increases": 145,
    "because": 146,
    "run": 147,
    "multiple": 148,
    "have": 149,
    "advantages": 150,
    "scale": 151,
    "independently": 152,
    "payment": 153,
    "without": 154,
    "goes": 155,
    "other": 156,
    "keep": 157,
    "monitoring": 158,
    "easier": 159,
    "monitor": 160,
    "separately": 161,
    "different": 162,
    "teams": 163,
    "cleaner": 164,
    "reusable": 165,
    "googles": 166,
    "system": 167,
    "used": 168,
    "products": 169,
    "great": 170,
    "when": 171,
    "decent": 172,
    "sized": 173,
    "solo": 174,
    "founder": 175,
    "fewer": 176,
    "users": 177,
    "fine": 178,
    "reach": 179,
    "millions": 180,
    "uptime": 181,
    "critical": 182,
    "move": 183,
    "just": 184,
    "cases": 185,
    "at": 186,
    "thanks": 187,
    "watching": 188,
    "vs": 189,
    "i": 190,
    "hope": 191,
    "understood": 192,
    "these": 193,
    "concepts": 194,
    "please": 195,
    "subscribe": 196,
    "liked": 197,
    "see": 198,
    "next": 199,
    "bye": 200,
    "take": 201,
    "care": 202,
    "hey": 203,
    "man": 204,
    "ok": 205
  },
  "invVocab": {
    "0": "[PAD]",
    "1": "[UNK]",
    "2": "[CLS]",
    "3": "[SEP]",
    "4": "alright",
    "5": "guys",
    "6": "welcome",
    "7": "back",
    "8": "to",
    "9": "another",
    "10": "exciting",
    "11": "episode",
    "12": "of",
    "13": "drive",
    "14": "with",
    "15": "me",
    "16": "in",
    "17": "this",
    "18": "video",
    "19": "we",
    "20": "will",
    "21": "talk",
    "22": "about",
    "23": "monolith",
    "24": "versus",
    "25": "microservices",
    "26": "architecture",
    "27": "understand",
    "28": "what",
    "29": "a",
    "30": "is",
    "31": "and",
    "32": "discuss",
    "33": "their",
    "34": "tradeoffs",
    "35": "you",
    "36": "should",
    "37": "use",
    "38": "lets",
    "39": "start",
    "40": "monolithic",
    "41": "mono",
    "42": "means",
    "43": "one",
    "44": "all",
    "45": "backend",
    "46": "code",
    "47": "stored",
    "48": "single",
    "49": "repository",
    "50": "for",
    "51": "example",
    "52": "an",
    "53": "ecommerce",
    "54": "app",
    "55": "authentication",
    "56": "orders",
    "57": "payments",
    "58": "product",
    "59": "are",
    "60": "place",
    "61": "push",
    "62": "your",
    "63": "deploy",
    "64": "the",
    "65": "entire",
    "66": "on",
    "67": "server",
    "68": "up",
    "69": "running",
    "70": "as",
    "71": "application",
    "72": "scales",
    "73": "becomes",
    "74": "bottleneck",
    "75": "cannot",
    "76": "handle",
    "77": "requests",
    "78": "solve",
    "79": "do",
    "80": "horizontal",
    "81": "scaling",
    "82": "by",
    "83": "adding",
    "84": "more",
    "85": "servers",
    "86": "add",
    "87": "load",
    "88": "works",
    "89": "but",
    "90": "there",
    "91": "problems",
    "92": "if",
    "93": "bug",
    "94": "whole",
    "95": "can",
    "96": "crash",
    "97": "services",
    "98": "like",
    "99": "go",
    "100": "down",
    "101": "not",
    "102": "good",
    "103": "ideally",
    "104": "fails",
    "105": "only",
    "106": "stop",
    "107": "working",
    "108": "has",
    "109": "no",
    "110": "segregation",
    "111": "also",
    "112": "over",
    "113": "time",
    "114": "complex",
    "115": "hard",
    "116": "manage",
    "117": "pro",
    "118": "that",
    "119": "easy",
    "120": "codebase",
    "121": "con",
    "122": "it",
    "123": "point",
    "124": "failure",
    "125": "solution",
    "126": "segregate",
    "127": "into",
    "128": "separate",
    "129": "called",
    "130": "each",
    "131": "feature",
    "132": "its",
    "133": "own",
    "134": "independent",
    "135": "microservice",
    "136": "service",
    "137": "managing",
    "138": "many",
    "139": "repositories",
    "140": "harder",
    "141": "need",
    "142": "team",
    "143": "developers",
    "144": "cost",
    "145": "increases",
    "146": "because",
    "147": "run",
    "148": "multiple",
    "149": "have",
    "150": "advantages",
    "151": "scale",
    "152": "independently",
    "153": "payment",
    "154": "without",
    "155": "goes",
    "156": "other",
    "157": "keep",
    "158": "monitoring",
    "159": "easier",
    "160": "monitor",
    "161": "separately",
    "162": "different",
    "163": "teams",
    "164": "cleaner",
    "165": "reusable",
    "166": "googles",
    "167": "system",
    "168": "used",
    "169": "products",
    "170": "great",
    "171": "when",
    "172": "decent",
    "173": "sized",
    "174": "solo",
    "175": "founder",
    "176": "fewer",
    "177": "users",
    "178": "fine",
    "179": "reach",
    "180": "millions",
    "181": "uptime",
    "182": "critical",
    "183": "move",
    "184": "just",
    "185": "cases",
    "186": "at",
    "187": "thanks",
    "188": "watching",
    "189": "vs",
    "190": "i",
    "191": "hope",
    "192": "understood",
    "193": "these",
    "194": "concepts",
    "195": "please",
    "196": "subscribe",
    "197": "liked",
    "198": "see",
    "199": "next",
    "200": "bye",
    "201": "take",
    "202": "care",
    "203": "hey",
    "204": "man",
    "205": "ok"
  },
  "nextId": 206
}